# 문제 1
virtual_signal_dict = [{'시간':'09:02:22', '종목명':'삼성전자', '현재가':79000, '매매시그널':'매수'},
                      {'시간':'11:11:55', '종목명':'푸드나무', '현재가':35000, '매매시그널':'매도'},
                      {'시간':'11:31:12', '종목명':'아이에이', '현재가':1600, '매매시그널':'매수'},
                      {'시간':'13:44:01', '종목명':'하이닉스', '현재가':102000, '매매시그널':'매수'},
                      {'시간':'15:09:26', '종목명':'심성전자', '현재가':79000, '매매시그널':'매수'},
                      {'시간':'15:26:15', '종목명':'HMM', '현재가':37000, '매매시그널':'매도'}]


print(f"매매 시그널 포착 : {시간} {종목명} {현재가} {매매시그널}")